[
  {
    "id": "hatebu-it-2-rld-outages/",
    "title": "Google SRE が Gemini CLI を使用して実際の障害を解決している方法 | Google Cloud 公式ブログ",
    "url": "https://cloud.google.com/blog/ja/topics/developers-practitioners/how-google-sres-use-gemini-cli-to-solve-real-world-outages/",
    "source": "Hatena:it",
    "bookmarkCount": 260,
    "summary": "Googleのサイト信頼性エンジニアリング（SRE）は、反復的な手作業を排除し、エンジニアリングされたシステムに置き換える「トイルの排除」を重要な使命としています。しかし、運用上の問題解決において、適切なタイミングで自動化をトリガーすることは容易ではありませんでした。この課題に対し、Google SREは最新の基盤モデルGemini 3と、エージェント機能をターミナルに導入するGemini CLIを活用することで、実際のインフラ障害発生時にユーザーに悪影響が及ぶ時間、すなわち平均緩和時間（MTTM）を大幅に短縮しています。SREはページング後わずか5分以内に問題を緩和するという厳しいサービスレベル目標を抱えており、迅速な対応が極めて重要とされる状況で、この技術が大きな力を発揮しています。\n\nGemini CLIの最大の強みは、単なる自動操縦ではなく、人間のSREを支援する「副操縦士」として機能する多層的な安全戦略を採用している点です。エージェントはランダムなスクリプトを記述する代わりに、厳密に型指定されたツールを選択し、各ツールの潜在的な影響に関するメタデータに基づいてリスク評価を行います。さらに、ポリシーレイヤで現在のコンテキストにおける実行の可否が確認され、最終的にはAIが提案した変更を人間のSREが承認することで、AIの処理速度と人間の責任保持を両立させています。これにより、障害発生時に手動で行っていたコンテキスト切り替え、ダッシュボードの開設、ログ分析といった時間のかかる作業が劇的に効率化され、診断から緩和策の実行までを統合されたワークフローで実現し、MTTMを大幅に短縮することを可能にしています。\n\nこの取り組みは、目の前の障害解決にとどまらず、将来に向けた自己改善の好循環も生み出しています。解決後のインシデントを文書化したポストモーテムがGeminiのトレーニングデータとして活用されることで、システムは継続的に学習し、過去の知見が未来の解決策に繋がるのです。さらに、Gemini CLIはGoogle社内のツールに限定されず、GrafanaやKubernetesなどの外部ツールにも接続可能で、カスタムコマンドによって特定のチームワークフローを自動化できるため、誰もがこの革新的なアプローチを用いて運用上のトイル排除に着手できる汎用性を持っています。",
    "category": "AI"
  },
  {
    "id": "hatebu-it-5-re-migration",
    "title": "Next.jsをVercelからCloudflareへ移行し、90%のコスト削減を実現した話 - Hello Tech",
    "url": "https://tech.hello.ai/entry/vercel-cloudflare-migration",
    "source": "Hatena:it",
    "bookmarkCount": 118,
    "summary": "グローバルレストラン予約サービスAutoReserveは、Next.jsアプリケーションであるWeb版をVercelで運用していました。SEOとパフォーマンス改善のためSPAからNext.js+Vercelへ移行した結果、Core Web Vitalsの向上やページロード時間の高速化といった明確な成果が得られました。しかし、サービスの成長とグローバル展開に伴い、Vercelの月額コストが約200万円と急増し、特にキャッシュが効きにくい多数のSSRページによるCompute課金やデータ転送に関する帯域幅課金が大きな負担となっていました。VercelのFluid Computeを検証したものの、レイテンシーの悪化などにより根本的な解決には至らず、持続可能なコスト構造への見直しが喫緊の課題となっていました。\n\nこのコスト課題に対し、Cloudflare Workersのパフォーマンス上の利点と管理の容易さに着目し、OpenNextを利用したCloudflareへの移行を決断しました。移行にあたっては、Cloudflare WorkersにおけるNode.jsの互換性、バンドルサイズ、メモリ制限といった技術的な制約への対応が必要でした。具体的には、不要なライブラリの削除やバンドル設定の最適化といった対策を講じることで、これらの技術的課題を克服し、本番環境への移行を実現しました。\n\n結果として、AutoReserveのフロントエンドインフラコストは月額請求ベースで約90%という大幅な削減を達成しました。これは帯域幅コストがゼロになったことや、Computeの時間単位単価が約1/4に削減されたことなどによるものです。さらに、Next.js+Vercel運用時と同等のパフォーマンスとSEO水準を維持しており、Web Vitals指標にも悪影響がないことを確認しています。この移行により、大規模なNext.jsアプリケーションにおける高コスト問題を解決し、将来のトラフィック増大にも対応できる持続可能なインフラコスト構造を確立できたことが、この取り組みの大きな成果と言えます。",
    "category": "Security"
  }
]