[
  {
    "id": "hatebu-it-11-n-spec-first",
    "title": "Claude16台で10万行のCコンパイラを作った論文を読んで、「いや答えあるじゃん」と思った話",
    "url": "https://zenn.dev/shio_shoppaize/articles/shogun-spec-first",
    "source": "Hatena:it",
    "bookmarkCount": 378,
    "summary": "Anthropicのエンジニアリングブログで発表された論文は、Claude 16台を2週間並列稼働させ、わずか2万ドルの費用で10万行のRust製Cコンパイラを開発したという驚異的な内容です。このAI開発は、Linux 6.9のブートやGCCテストスイートの99%パス、さらにはDoomやFFmpeg、PostgreSQLのコンパイルに成功するなど、極めて高い完成度を示しました。特に、AIエージェントが自律ループでタスクを自動取得し、Gitのファイルロックのみで同期を取りながら、テストケースを仕様書として人間の介入をほとんど必要とせずに開発を進めた点からは、その効率性と大規模開発へのAI適用可能性の高さがうかがえます。\n\nしかし筆者は、この成果がCコンパイラという「GCCという完璧な正解」が存在する特殊な条件下で達成されたものであることを指摘し、現実世界の「答えがない」問題へのAI適用には異なるアプローチが必要だと主張します。Cコンパイラではテストがそのまま仕様となり、AIが「何を正解とすべきか」を迷うことなく実装に集中できたのに対し、SaaSのAPI設計や業務自動化のような課題では、まず人間が「何を作るべきか」という仕様を明確に定義することが最も難しい段階であり、AIにそれを任せてしまうと間違ったものを完璧に作りかねないと述べます。そのため、AIには「どう作るか」という実装を任せ、人間が「何を作るか」という仕様を決定する明確な分業こそが、AI駆動開発を成功させる鍵であると結論付けています。\n\n要するに：AIは実装能力に優れるが、Cコンパイラのような明確な正解がある課題でこそ真価を発揮し、不明確な問題では人間が仕様を定義する役割が不可欠である。",
    "category": "AI"
  },
  {
    "id": "hatebu-it-17-%BA%E7%A4%8E",
    "title": "AWSにおけるアウトバウンドセキュリティの基礎 - 電通総研 テックブログ",
    "url": "https://tech.dentsusoken.com/entry/2026/02/10/AWS%E3%81%AB%E3%81%8A%E3%81%91%E3%82%8B%E3%82%A2%E3%82%A6%E3%83%88%E3%83%90%E3%82%A6%E3%83%B3%E3%83%89%E3%82%BB%E3%82%AD%E3%83%A5%E3%83%AA%E3%83%86%E3%82%A3%E3%81%AE%E5%9F%BA%E7%A4%8E",
    "source": "Hatena:it",
    "bookmarkCount": 24,
    "summary": "Webアプリケーション開発ではインバウンド通信のセキュリティが重視されがちですが、実際にはマルウェア感染サーバからの外部への悪意ある通信防止、ソフトウェアサプライチェーンにおける意図しない参照先へのアクセス制御、さらには不正アクセスや異常通信パターンの検知といった「防御」の観点、そして設定ミスの発見やセキュリティログの充実といった「可視性」の観点から、アウトバウンドセキュリティの重要性が近年飛躍的に高まっています。これまであまり意識されることのなかった外部への通信の安全確保が、企業のセキュリティ対策において不可欠な要素としてクローズアップされているのです。\n\nこのような状況に対し、AWSは複数のマネージドサービスを提供することで、複雑なアウトバウンドセキュリティ対策を効率的かつ容易に実現できる点が画期的です。具体的には、DNSレベルで不正なドメインへの通信を遮断するRoute 53 Resolver DNS Firewall、L3からL7のパケットヘッダに基づき通信をステートフルに制御し、Gateway Load Balancer連携により運用負荷を大幅に軽減するNetwork Firewall、そしてHTTP/HTTPS通信に特化したマネージドフォワードプロキシ機能を提供するNetwork Firewall Proxyが挙げられます。これらのサービスを組み合わせることで、DNSベース、パケットベース、プロキシベースでの多層防御が可能となり、高度なセキュリティをAWS上でマネージドに構築・運用できる点が、企業にとって非常に強力なソリューションとなります。\n\n要するに：AWSはマネージドサービス群で、見過ごされがちだったアウトバウンドセキュリティを、防御と可視性の両面から効率的かつ多層的に強化し、運用負荷も軽減する。",
    "category": "Security"
  }
]