[
  {
    "id": "hatebu-it-16-n-spec-first",
    "title": "Claude16台で10万行のCコンパイラを作った論文を読んで、「いや答えあるじゃん」と思った話",
    "url": "https://zenn.dev/shio_shoppaize/articles/shogun-spec-first",
    "source": "Hatena:it",
    "bookmarkCount": 380,
    "summary": "Anthropicのエンジニアが、Claude 16台を並列で2週間稼働させ、わずか2万ドルで10万行ものRust製Cコンパイラを開発したという画期的な事例が紹介されています。このコンパイラはLinux 6.9のブートに成功し、GCCのテストスイートで99%をパスする高い完成度を誇り、DoomやFFmpeg、PostgreSQLといった主要なソフトウェアのコンパイルも可能です。特に注目すべきは、AIが自律ループでタスクを自動的に取得し、Gitのファイルロックのみで同期を取りながら、人間による介入なしに「テストをパスさせる」という指示だけで開発を完遂した点で、その運用効率と自律性の高さは目覚ましい成果と言えます。\n\nしかし筆者は、この成功はCコンパイラという題材に「GCCという正解」が存在し、完璧なテストスイートが仕様書として機能する「答え合わせができる世界」であったことが大きいと指摘します。現実の「SaaSのAPI設計」や「業務フロー自動化」のような「答えがない世界」では、「何を作るか」という仕様定義が最も困難であり、AIに任せると「間違ったものを完璧に作る」リスクがあると強調しています。そのため筆者自身は、安価な月額サブスクリプションでAIを継続的に利用しつつ、人間が「仕様」を定義し、AIには「どう作るか」という実装部分を任せるという分業体制を取ることで、より複雑な問題に対処していると述べています。\n\n要するに：AIによる自律的な大規模開発は可能だが、その成功は「完璧な正解とテストが存在する問題」に限られ、人間が「何を作るか」の仕様を定義する役割は依然として不可欠である。",
    "category": "AI"
  },
  {
    "id": "hatebu-it-19-%BA%E7%A4%8E",
    "title": "AWSにおけるアウトバウンドセキュリティの基礎 - 電通総研 テックブログ",
    "url": "https://tech.dentsusoken.com/entry/2026/02/10/AWS%E3%81%AB%E3%81%8A%E3%81%91%E3%82%8B%E3%82%A2%E3%82%A6%E3%83%88%E3%83%90%E3%82%A6%E3%83%B3%E3%83%89%E3%82%BB%E3%82%AD%E3%83%A5%E3%83%AA%E3%83%86%E3%82%A3%E3%81%AE%E5%9F%BA%E7%A4%8E",
    "source": "Hatena:it",
    "bookmarkCount": 24,
    "summary": "Webアプリケーション開発ではインバウンド通信のセキュリティが重視されがちですが、マルウェア感染防止やソフトウェアサプライチェーンの制御といった防御の側面、さらには設定ミス検知やセキュリティログの充実による可視性の側面から、アウトバウンド通信のセキュリティの重要性が近年増しています。外部への不正な通信を防ぎ、異常を早期に発見することは不可欠であり、DNSベース、パケットヘッダベース、ボディベースのフィルタリングを組み合わせることで、より強固な多層防御を形成する必要があると考えられます。\n\nこうした高度なアウトバウンドセキュリティ対策を容易に実現できるのが、AWSが提供するマネージドサービス群です。DNSレベルでのフィルタリングを担うRoute 53 Resolver DNS Firewall、TCP通信の状態を追跡しL3からL7でのステートフルなパケットフィルタリングを可能にするAWS Network Firewall、そしてHTTP/HTTPS通信に特化したマネージドなフォワードプロキシサービスであるAWS Network Firewall Proxyが主な選択肢として挙げられます。特にNetwork FirewallはGateway Load Balancerとの連携により、運用負荷を大幅に削減しながら複雑な通信制御を実現し、これらのサービスを組み合わせることで、低コストで効果の高い対策から段階的に導入し、継続的にセキュリティレベルを向上させることが可能となります。\n\n要するに：見過ごされがちなアウトバウンド通信のセキュリティは防御と可視性において極めて重要であり、AWSのマネージドサービス群を活用することで高度な多層防御を効率的かつ容易に実現できます。",
    "category": "Security"
  }
]