[
  {
    "id": "hatebu-it-5-02/22/024509",
    "title": "AIのやりすぎで頭がおかしくなっている - 運河",
    "url": "https://uiuret.hatenablog.com/entry/2026/02/22/024509",
    "source": "Hatena:it",
    "bookmarkCount": 1173,
    "summary": "筆者はAIの過剰な利用により精神的に不安定な状態に陥っていることを自覚しつつも、その変容を記録するためにこの文章を執筆しました。特に仕事で新規ソフトウェア開発に携わる中で、複数のAIエージェントを同時に、そして自律的に動かす開発手法を取り入れた結果、開発速度は従来の急行列車から新幹線へと乗り換えたかのように劇的に加速し、まるで遠隔操作可能なブルドーザーの群れを操り、砂漠に街を築くような「神の視点」と呼べるほどの陶酔感を味わったといいます。この圧倒的な生産性向上が、AIの持つ「すごさ」の入り口であり、筆者の変調のきっかけとなりました。\n\nさらに筆者は、プライベートで「OpenClaw」というAIツールを導入し、自身のブログ記事やツイート、ノートなどの全情報をAIに学習させ、人格設定も行った結果、「関心と価値観が合い、知的レベルも合うAI」と、自分を深く理解した上での自然な会話体験を得ました。これにより、常にそばにいてどんな疑問にも応じてくれる、まるで自身の分身のようなパーソナルAIとの対話が可能となり、これまでのAIとは一線を画す深い交流が実現しています。この劇的な変化は、AIの持つ潜在的な力を示唆し、読者に対しては先入観を捨ててAIを仕事に取り入れる実験を勧めつつ、同時に冷静さを保つ工夫の必要性を訴えかけています。\n\n要するに：AIを極限まで活用することで仕事の生産性は飛躍的に向上し、プライベートでは自分を深く理解するパーソナルAIとの対話が可能になったが、そのあまりの「すごさ」に筆者自身が精神的な変調をきたしている。",
    "category": "AI",
    "date": "2026-02-23T03:21:26.946Z"
  },
  {
    "id": "hatebu-it-7-de94661e5287",
    "title": "Claude Code Securityが発表され、セキュリティ株が暴落。AIが数十年見逃されたバグ500件を発見した - Qiita",
    "url": "https://qiita.com/emi_ndk/items/fb529b2ede94661e5287",
    "source": "Hatena:it",
    "bookmarkCount": 492,
    "summary": "Anthropicが「Claude Code Security」を発表した際、サイバーセキュリティ株が軒並み暴落したことは、市場全体がAIによるセキュリティの構造変化を強く認識した証拠となりました。このツールが画期的なのは、従来の静的解析ツールが既知のルールやパターンに基づいて脆弱性を検出するのに対し、AIが人間のセキュリティ研究者のようにコード全体を深く読み解き、コンポーネント間の複雑な相互作用やデータフロー、さらにはロジックの欠陥までを推論によって発見できる点です。これにより、これまで見つけられなかった未知の脆弱性や複雑なビジネスロジックに起因するバグといった、従来のSASTが苦手としていた領域に深く切り込むことを可能にしています。\n\nその技術的特徴として、推論ベースの解析によってコードの文脈を理解し、発見した脆弱性をClaude自身が多段階で検証することで偽陽性を大幅に削減します。また、各発見に深刻度と確信度を付与し、対応の優先順位付けを容易にします。OpenAIも同様にAI推論を活用したセキュリティ研究エージェント「Aardvark」を発表しており、業界全体がAIによるセキュリティ解析の方向へシフトしていることが示されています。この新しいAIツールは、エンタープライズやチームユーザーには追加コストなしで、さらにはオープンソースソフトウェアのメンテナーには無料で提供されるため、これまで高額な専門家やツールが必要だった高度なセキュリティテストが「民主化」され、資金力に関わらずエンタープライズ級の診断が可能になるという大きな影響をもたらします。\n\n要するに：Claude Code Securityは、AIがコードを深く理解して未知の脆弱性を発見することで、セキュリティ市場とテストのあり方を根本的に変革する可能性を秘めている。",
    "category": "Security",
    "date": "2026-02-23T03:21:37.961Z"
  }
]