[
  {
    "id": "hatebu-it-1-n-spec-first",
    "title": "Claude16台で10万行のCコンパイラを作った論文を読んで、「いや答えあるじゃん」と思った話",
    "url": "https://zenn.dev/shio_shoppaize/articles/shogun-spec-first",
    "source": "Hatena:it",
    "bookmarkCount": 262,
    "summary": "Anthropicのエンジニアリングブログで発表された論文では、Claude 16台を2週間にわたり並列で稼働させ、わずか2万ドルの費用で10万行ものRust製Cコンパイラを開発したという驚くべき成果が紹介されました。このコンパイラはLinux 6.9のブートに成功し、GCCのテストスイートの99%をパス、DoomやFFmpeg、PostgreSQLなどもコンパイルできる高い性能を誇ります。この偉業は、タスク完了後に自動的に次を拾う「自律ループ」やGitファイルロックのみによる軽量な同期、テストケースそのものを仕様書として活用する画期的な運用設計によって実現されており、人間の介入を最小限に抑えながら高度な開発を成し遂げた点に大きな注目が集まっています。しかし筆者は、Cコンパイラという題材がGCCという「正解」を明確に持ち、テストスイートによってその仕様が完全に定義される「答え合わせができる世界」であったことが、この成功の決定的な要因であると指摘し、「いや、答えあるじゃん」と冷静な分析を加えています。\n\n筆者は自身のAI部下運用経験を踏まえ、現実世界の多くの課題、例えばSaaSのAPI設計や業務フローの自動化、レガシーコードのリファクタリングなどには、Cコンパイラのような「完璧な正解」や「完璧な検証器」は存在しないと強調します。そのような「答えがない世界」でAIに「何を作るか」を任せると、AIは「間違ったものを完璧に作ってしまう」リスクがあるため、最も難しいのは実装そのものではなく、まず「何を作るか」を明確に定義することにあると述べています。そのため、筆者のアプローチでは、人間が「何を作るか」という仕様を定義し、そこから導出されるテストケースを基に、AIには「どう作るか」つまりテストをパスする実装作業を任せるという明確な分業体制を敷いています。この人間とAIの適切な分業こそが、AI駆動開発において最も効率的であり、答えのある問題とない問題でAIの最適な活用法が異なることを示唆しています。\n\n要するに：AIの真価を引き出すには、「何を作るか」という仕様定義は人間が行い、「どう作るか」という実装をAIに任せる分業が最も効率的である。",
    "category": "AI"
  },
  {
    "id": "hatebu-it-5-re-migration",
    "title": "Next.jsをVercelからCloudflareへ移行し、90%のコスト削減を実現した話 - Hello Tech",
    "url": "https://tech.hello.ai/entry/vercel-cloudflare-migration",
    "source": "Hatena:it",
    "bookmarkCount": 111,
    "summary": "AutoReserveはグローバルなレストラン予約サービスを展開しており、Web版のNext.jsアプリケーションをSPAからVercelでホスティングすることで、Core Web Vitalsの改善やページロード時間の高速化といった明確なパフォーマンス向上を達成しました。しかし、サービスの急速な成長とグローバル展開に伴い、キャッシュが効きづらい多量のページ構成とロングテールトラフィックが原因で、Vercelの月額インフラコストが約200万円にまで急増し、持続可能性が深刻な課題となっていました。特に、Compute課金とデータ転送による帯域幅課金がコスト増加の主要因であり、Vercelが提供するFluid Computeの導入も、レイテンシー悪化などの問題から抜本的な解決には至らず、根本的なコスト削減が喫緊の課題でした。\n\nこのような背景のもと、筆者らはNext.jsアプリケーションをVercelからOpenNextとCloudflare Workersの組み合わせへと大胆に移行することを決断し、Cloudflare Workersの持つ優れたオートスケール能力や管理の容易さ、パフォーマンス上の優位性を活用しました。この移行においては、Node.jsの互換性、バンドルサイズ、メモリ使用量といったCloudflare Workers特有の技術的制約を一つ一つ克服する綿密な対応が求められましたが、その結果、フロントエンドのインフラコストを月額請求ベースで約90%も削減することに成功しました。これは、帯域幅コストをゼロに、Computeコストも大幅に低減しながら、移行前と同等の優れたパフォーマンスとSEO効果を維持するという驚くべき成果であり、大規模Next.jsアプリケーションにおけるVercelの課金構造の課題を解決し、サービスの持続的な成長を可能にする画期的なインフラを実現しました。\n\n要するに：Vercelで月200万円かかっていたNext.jsアプリのインフラコストを、Cloudflareへ移行することでパフォーマンスを維持したまま約90%削減した。",
    "category": "Security"
  }
]