[
  {
    "id": "hatebu-it-9-06b4a0865acb",
    "title": "Gemini × NotebookLM 連携で「自分専用エージェント」を量産する：蓄積した履歴を血肉化する究極の活用術",
    "url": "https://zenn.dev/minipoisson/articles/2806b4a0865acb",
    "source": "Hatena:it",
    "bookmarkCount": 336,
    "summary": "GeminiとNotebookLMの連携は、これまでのAI活用における課題、すなわち蓄積された膨大な情報から特定の目的のために毎回手動で指示や資料を指定する手間を劇的に解消します。以前はGeminiの全履歴をNotebookLMに集約し検索や分析は可能でしたが、記事作成や自己分析といった目的に使うたびに「〇〇の文体で書いて」といった指示や関連資料を都度指定するのは、多大な負担となっていました。この課題に対し、2026年1月からGeminiチャットでNotebookLMのノートブックを資料として直接指定できるようになった機能と、2024年8月から利用可能な、繰り返し使う指示や資料を予め設定できるGeminiのGems機能を組み合わせることで、画期的な解決策が提示されています。\n\nこの画期的な連携の核は、NotebookLMを過去のチャット履歴という「長期記憶」として、そしてGemsを特定の役割や「人格」を与えるシステム指示として機能させる、役割と知識の明確な分離にあります。これにより、ユーザーは膨大な背景知識を基に自分を熟知した「専属エージェント」を、特定の目的に合わせてワンクリックで起動できるようになります。例えば、Zenn執筆用やnote.com記事作成用といったエージェントが、短い指示文で数百万トークン規模の知識を基に動作し、最適なコンテンツ提案や支援を自動で行ってくれるため、AIは単なる検索ツールではなく、個人の活動に深く寄り添う「共生するパートナー」へと進化する点が最大の魅力です。\n\n要するに：GeminiのGemsとNotebookLMの連携により、自分の全履歴を血肉とした「自分専用AIエージェント」を目的別にワンクリックで起動できるようになりました。",
    "category": "AI",
    "date": "2026-02-11T06:38:17.452Z"
  },
  {
    "id": "hatebu-it-2-s/20260210a/",
    "title": "ログ設計ガイドラインを公開しました | フューチャー技術ブログ",
    "url": "https://future-architect.github.io/articles/20260210a/",
    "source": "Hatena:it",
    "bookmarkCount": 342,
    "summary": "フューチャー社内の有志メンバーは、システムの稼働状況可視化やトラブル発生時の迅速な原因特定に不可欠なログ設計において、これまでのプロジェクトごとのばらつきや十分な活用がされていない現状を改善するため、ログ設計ガイドラインを作成し公開しました。これは、システムが複雑化しマイクロサービスやクラウドネイティブな構成が主流となる現代において、ログが単なるデバッグ情報ではなくオブザーバビリティの基盤としての役割を果たすよう進化している背景を受け、必要な情報不足による原因追求の困難さや、フォーマットの不統一による横断的な集計の難しさ、無駄なログ出力によるコスト増加や性能劣化といった、従来の課題を包括的に解決しようとするものです。\n\nこのガイドラインが優れているのは、特定のプラットフォームに依存せずOpenTelemetryやElastic Common Schemaといった標準をベースとした移植性の高い命名規則を推奨し、ログ解析ツールの利用効率を高めている点です。さらに、マイクロサービスなどの分散システムにおける処理の追跡を可能にするトレースIDや、HTTP/DBリクエストの詳細なコンテキスト情報など、エラー発生時の原因特定に不可欠な高解像度のコンテキスト情報の付与を具体的に示しています。また、ログメッセージの書き方における事実とデータの分離やメッセージコードの導入、さらにはセキュリティと機密情報への配慮まで網羅することで、開発者と運用者がより効率的かつ安全にシステムを運用するための、実践的かつ網羅的な指針を提供している点が特筆されます。\n\n要するに：フューチャーが公開したログ設計ガイドラインは、ばらつきがちだったログ設計を標準化し、複雑なシステムにおいても迅速な原因特定と効率的な運用を可能にする実用的な指針です。",
    "category": "Security",
    "date": "2026-02-11T06:38:28.009Z"
  }
]