[
  {
    "id": "hatebu-it-10-news086.html",
    "title": "富士通、ソフトウェア開発の全工程をAIで自動化　“生産性100倍”に　独自LLM「Takane」活用",
    "url": "https://www.itmedia.co.jp/aiplus/articles/2602/17/news086.html",
    "source": "Hatena:it",
    "bookmarkCount": 203,
    "summary": "富士通は、AIを活用してソフトウェア開発の全工程を自動化する「AI-Driven Software Development Platform」を発表しました。この画期的なプラットフォームは、AI開発パートナーのCohereとの連携に加え、富士通独自のLLM「Takane」を活用することで実現しており、これによりソフトウェア開発の生産性が最大で100倍に向上すると見込まれています。複雑な開発プロセス全体をAIで大幅に効率化できる点が、この取り組みの最大のすごさと言えるでしょう。\n\n具体的には、このプラットフォームの中核をなす「Takane」はAIエージェントと連携し、仕様変更に伴うシステム改修のタイプ洗い出し、最適な改修箇所の提案、さらにはテストケースの生成までの一連のプロセスを自動で完結させます。2024年度の社内プロジェクトでの実証では、実際に約300件の改修のうち1件で生産性が100倍に向上した実績があり、2026年からは段階的に社内外のソフトウェア開発へ導入される予定です。富士通はさらに、AIによるシステム開発を加速するため、データ整備やエンジニアのスキル変革を進める「AI-Ready Engineering」を通じて、開発体制全体をAI前提で最適化していく方針です。\n\n要するに：富士通はAIでソフトウェア開発の全工程を自動化し、独自のLLM「Takane」を活用することで生産性を最大100倍に高める画期的なプラットフォームを発表しました。",
    "category": "AI",
    "date": "2026-02-18T03:19:50.533Z"
  },
  {
    "id": "hatebu-it-1-so/openclaw/",
    "title": "OpenClawの何が特別なのか？",
    "url": "https://blog.lai.so/openclaw/",
    "source": "Hatena:it",
    "bookmarkCount": 348,
    "summary": "OpenClawは、著名なiOS開発者として知られるsteipeteが手掛けたオープンソースの自律型AIエージェントであり、個人が自身のPC上で、まるでDevinのような高度な自律型アシスタントを安価に運用できる革新的なシステムです。これは従来のコーディングエージェントとは一線を画し、LLMにPCの強い権限を与え、常時起動によるチャット連携、スキル管理、そして定期的な推論からツール実行までを一貫して自動で行う「HEARTBEAT」機能により、ユーザーが指示せずとも自律的にタスクを遂行し続ける点で、現行の個人運用エージェントの中でも最も先行しています。Agent Skillsというプロンプト拡張の新世代な仕組みを基盤とし、外部SDK等に依存しない独自構築がその特別さを際立たせています。\n\nこのAgent Skillsの仕組みは、LLMがプロンプトに注入されたスキルファイルを読み込むことで、PC上で任意のコマンドやコードを実行できるため、原理的には多様なタスクを自動化する無限の可能性を秘めています。ユーザーはエージェントのワークスペースを通じて、その「魂」とも言える人格や記憶を自ら育て上げ、カスタマイズする自由を享受できます。しかしながら、その強力な自律性とPCへの深いアクセス権限は、セキュリティ上の大きな課題と隣り合わせです。意図しないプロンプトインジェクションによる悪意あるコマンド実行のリスクは依然として「未解決の問題」とされており、OpenClawを利用する際には、その高い能力とそれに伴うセキュリティ上の危険性を深く理解した上で、自己責任において慎重に付き合うことが求められます。\n\n要するに：OpenClawは、個人がPCを高度に自動操縦できる革新的なオープンソースAIエージェントだが、その強力な自律性と権限は高いセキュリティリスクと隣り合わせである。",
    "category": "Security",
    "date": "2026-02-18T03:20:04.165Z"
  }
]