[
  {
    "id": "hatebu-it-0-e26d4d078386",
    "title": "Claude Opus 4.6で作る、PowerPointでそのまま編集できる高品質スライド｜IT navi",
    "url": "https://note.com/it_navi/n/ne26d4d078386",
    "source": "Hatena:it",
    "bookmarkCount": 464,
    "summary": "AIを使ったスライド作成は以前から可能でしたが、生成されたスライドが画像として埋め込まれるため、後から文字や図表の編集が困難であるという課題を抱えていました。しかし、Claude Opus 4.6を用いると、作成されるスライドはパーツごとに分かれたpptxファイルとして出力されるため、PowerPoint上で直接、テキストや図表を含めて自由に修正できる点が大きな強みとなります。さらに、専用のスキルを構築することで、洗練されたデザインの高品質スライドを安定して繰り返し生成できる点が画期的な進化です。\n\nこの高品質なスライド生成を実現するためには、参考となるスライドや詳細なプロンプトをClaudeに分析させてスキルを作成します。特に「マッキンゼー風スライド」のプロンプトでは、グラフや表の視覚化、フレームワークの構造、フォントや色、線の太さといった具体的なデザイン要素から、日本語のフォント指定、文字サイズ、テキストボックスの幅、句読点、敬語レベルに至るまで、非常に細かい指示が盛り込まれています。その結果、HBRのようなプロフェッショナルなビジネスプレゼンテーションが複数スライドにわたって自動生成され、出力されたスライドは微調整後、即座に活用できる完成度を持つことが示されています。\n\n要するに：Claude Opus 4.6は、PowerPointで編集可能な高品質スライドを、詳細な指示に基づいて安定的に生成できるため、従来のスライド作成AIの課題を解決し、プロフェッショナルな資料作成を効率化する。",
    "category": "AI",
    "date": "2026-02-24T03:16:20.152Z"
  },
  {
    "id": "hatebu-it-9-/detail_809/",
    "title": "世界屈指の「ランサムウェアに金を払わない国」なはずの日本にサイバー攻撃が増えている理由【上原哲太郎＆増田幸美】 レバテックラボ（レバテックLAB）",
    "url": "https://levtech.jp/media/article/focus/detail_809/",
    "source": "Hatena:it",
    "bookmarkCount": 22,
    "summary": "日本企業はランサムウェアに対し、世界平均を大きく下回る32%しか身代金を支払わない国として知られ、災害対策としてのバックアップ体制や反社会的勢力への利益供与を拒む高いコンプライアンス意識がその要因とされてきました。しかし、攻撃は激化する一方で、警察庁の発表ではランサムウェア被害が過去最多水準に達し、さらに世界のメール脅威の約8割が日本に集中していると報告されています。これは日本が攻撃者にとって「おいしい市場」と見なされている可能性を示唆しており、加えて、身代金を支払ってもデータ復旧率がわずか17%と極めて低い実態も明らかになっています。\n\nこの状況の背景には、攻撃者が防御の堅い大企業から、意外にも内部留保を有し、攻撃コストが下がったことで効率的な標的となった中小企業への戦略シフトがあると考えられます。特に、コロナ禍以降のDX推進と人手不足が、ITリテラシーや管理体制が追いつかないまま業務システムを無防備にインターネットへ接続させ、VPNやクラウドサービスの急増によって攻撃を受ける「表面積」を広げてしまいました。結果として、従業員300〜500人規模の中堅企業では、「ひとり情シス」や部門ごとのシステム乱立によるセクショナリズムが、全社的なセキュリティの「穴」を誰も把握できない管理不全を招いています。これらの課題に対し、組織のコアデータを定義し、リスクとコストを考慮してデジタルだけでなく物理的な隔離も含む最適な技術選定とリソース配分を行う、といった根本的な対策が強く求められています。\n\n要するに：日本は身代金を払わない国であるにも関わらず、DXの歪みと管理不全を抱える中小企業が攻撃者にとって「おいしい市場」となっており、基本的な対策とリスクを考慮したデータ保護戦略が急務です。",
    "category": "Security",
    "date": "2026-02-24T03:16:37.016Z"
  }
]