[
  {
    "id": "hatebu-it-14-d-generator/",
    "title": "AGENTS.mdを自動で育てる仕組みを作った",
    "url": "https://nyosegawa.github.io/posts/agents-md-generator/",
    "source": "Hatena:it",
    "bookmarkCount": 295,
    "summary": "AIコーディングエージェントが参照する設定ファイルであるAGENTS.md（またはCLAUDE.md）は、新規プロジェクトごとに内容を考案する手間や、プロジェクトの進行と共に情報が陳腐化し、エージェントの認識を妨げる「劣化」の問題を抱えていました。理想としては、最初に最小限の足場を構築すれば、コードの成長に合わせて内容も自然に充実していく「生きたドキュメント」としてAGENTS.mdが育つことであり、特にエージェントが確実に従える指示には20〜30行程度の量的な上限があるため、何を書くかよりも何を書かないかという情報選定が極めて重要だと筆者は指摘します。\n\nこの課題に対し、筆者は新しいリポジトリ作成時にAGENTS.mdの最適な初期状態を自動で生成する「agents-md-generator」を開発しました。このツールは、具体的な情報を書き込んだら削除すべきプレースホルダーや、常に最新性を保つためのメンテナンス指示を組み込むことで、開発者が手動で煩雑な管理をすることなく、AGENTS.mdを常に最新かつ最適な指示量に維持することを可能にします。これにより、開発者は初期設定の手間から解放され、AIエージェントは常に正確で効率的な指示を受け取れるため、最大限のパフォーマンスを発揮できるようになる点が画期的なのです。\n\n要するに：AIエージェント向け設定ファイルAGENTS.mdの作成・維持における手間を解消し、常に最適な状態での自動育成を実現することで、開発効率とエージェントの性能を劇的に向上させる仕組みを開発した。",
    "category": "AI",
    "date": "2026-02-16T03:59:54.852Z"
  },
  {
    "id": "hatebu-it-8-dee08b72db63",
    "title": "また病院がVPN経由でやられたわけだがVPNは悪だね｜ロードバランスすだちくん（仮）",
    "url": "https://note.cloudnative.co.jp/n/ndee08b72db63",
    "source": "Hatena:it",
    "bookmarkCount": 847,
    "summary": "日本医科大学武蔵小杉病院がVPN装置経由でランサムウェア攻撃を受け、約1万人分の患者情報が流出する事件が発生しましたが、これは過去の複数の病院での事例と同様にVPNが侵入口となっています。その根本には、インターネットに面して常時稼働するVPN装置が、設置ベンダー、運用者、メーカー、そして現場の担当者全員による寸分の隙もない完璧な運用が必須であるにもかかわらず、人間は必ずミスをするという前提を無視した「Fragile by Design」な設計上の欠陥を本質的に抱えているという問題があります。この構造的な脆弱性が、繰り返しランサムウェア攻撃の主要な侵入口となっている現状の根本原因として指摘されており、技術が中立なのではなく、設計そのものが現代のセキュリティ脅威に対応できていないという点が重要です。\n\n厚生労働省のガイドライン第6.0版は、「閉域だから安全」という従来の考え方を明確に否定し、ネットワーク境界防御型思考からゼロトラストネットワーク型思考への転換を強く推奨しています。さらに、VPNを利用する場合でもクライアント証明書を用いた認証や二要素認証の導入を必須としており、これら要件を満たしていない現状の多くのVPN運用はガイドライン違反の状態にあります。リモート保守にはVPNが唯一の手段という誤解がありますが、ゼロトラストネットワークアクセス（ZTNA）のような技術を活用すれば、必要なシステムにのみ限定的なアクセスを許可する安全なリモート保守が可能であり、政府のデジタル庁もゼロトラストアーキテクチャの適用方針を明示するなど、より高度なセキュリティ対策が求められているのが現状です。\n\n要するに：VPNは構造的に脆弱で、完璧な運用が非現実的であるため、政府のガイドラインも推奨するゼロトラストへの移行が喫緊の課題である。",
    "category": "Security",
    "date": "2026-02-16T04:00:07.243Z"
  }
]