[
  {
    "id": "hatebu-it-3-e4eaea995cc9",
    "title": "Anthropic公式「スキル構築ガイド」を読み解く──Claude Codeの真の拡張はここにある - Qiita",
    "url": "https://qiita.com/nogataka/items/cace9602e4eaea995cc9",
    "source": "Hatena:it",
    "bookmarkCount": 483,
    "summary": "Anthropicが公開した「スキル構築ガイド」は、Claudeに特定のタスクを一貫して実行させる「スキル」という仕組みを解説しています。これは、Markdownファイル一つでClaudeの振る舞いを変更できる「再利用可能なプロンプト」として機能し、プログラミング知識を必要とせず誰でも簡単に記述できる点が特徴です。その真の威力は、情報が段階的に開示される設計思想にあり、例えばスキルの概要部分は常に読み込まれる一方、具体的な指示はClaudeが必要と判断した時だけ展開されるため、限られたコンテキストウィンドウを効率的に利用し、複数のスキルを有効にしてもトークンを圧迫せず、専門性を維持しながら実用的に機能する点が画期的です。\n\nこの効率的な設計に加え、複数のスキルを組み合わせて利用できる「コンポーザビリティ」により、ドキュメントやアセットの作成から、複数のステップを含むワークフローの自動化、さらには外部ツール連携（MCP強化）まで、幅広い用途に対応可能です。バリデーションや失敗時の指示をスキルに組み込むことで、Claudeの出力品質を一貫させ、使い方の説明自体をClaudeに埋め込むような形で、単なるプロンプトの保存を超えて、その判断と出力品質を構造的に底上げする仕組みとして機能します。組織全体でのデプロイやAPIを通じたプログラマティックな制御も可能であり、その汎用性と拡張性はClaude Codeの真の能力を引き出すと言えるでしょう。\n\n要するに：Claudeの行動と出力品質を、効率的なコンテキスト利用と構造化された指示によって、再利用可能かつ拡張性の高い形で一貫させる仕組みがスキルです。",
    "category": "AI",
    "date": "2026-02-19T03:17:54.163Z"
  },
  {
    "id": "hatebu-it-2-2087007.html",
    "title": "アサヒグループHD、ランサムウェア攻撃によるシステム障害について、調査が完了した内容と再発防止策を公開　取引先や従業員の情報約11万5000件の漏えいを確認",
    "url": "https://internet.watch.impress.co.jp/docs/news/2087007.html",
    "source": "Hatena:it",
    "bookmarkCount": 69,
    "summary": "アサヒグループホールディングスは、2025年9月29日に発生したサイバー攻撃によるシステム障害について、その詳細な調査結果と再発防止策を公表しました。この攻撃では、システム障害発生の約10日前に外部攻撃者がネットワーク機器を経由して侵入し、パスワードの脆弱性を突いて管理者権限を奪取、主に業務時間外にネットワーク内部を探索し、複数のサーバーへの侵入と偵察を繰り返したことが判明しました。これにより、日本で管理されているシステムを中心に複数のサーバーや一部の従業員用PCが暗号化され、特に取引先や従業員の個人情報約11万5000件の漏えいが確認されましたが、クレジットカード情報は含まれておらず、インターネット上への情報公開は一部に留まっています。\n\n同社は、システム障害発生直後に被害拡大を防ぐためネットワークを遮断し、データセンターを隔離するという迅速な初期対応を取りました。その後、外部専門機関と協力して詳細なフォレンジック調査とシステムの安全な復旧を進め、2025年12月には主要な受注・出荷業務を再開させ、2026年2月までには物流業務全体をほぼ正常化させました。今回の経験を踏まえ、再発防止策としてグループ全体の「サイバーセキュリティ基準」を制定し、多要素認証・権限管理の強化、インフラおよびクラウド環境のセキュリティ強化、システム復旧能力の向上、従業員向けの継続的なセキュリティ教育を実施するとともに、情報セキュリティを管轄する独立組織の設置や、取締役会による監視・監督機能の強化といった、抜本的なガバナンス体制の強化を図っています。\n\n要するに：サイバー攻撃で約11.5万件の情報が漏えいしたものの、アサヒグループHDは迅速にシステムを復旧させ、技術とガバナンス両面から徹底した再発防止策を講じている。",
    "category": "Security",
    "date": "2026-02-19T03:18:04.477Z"
  }
]