[
  {
    "id": "hatebu-it-4-a0187b721607",
    "title": "非エンジニアがClaude Codeでアプリを作って公開した全記録",
    "url": "https://zenn.dev/tiaroka/articles/f6a0187b721607",
    "source": "Hatena:it",
    "bookmarkCount": 247,
    "summary": "ライターである非エンジニアが、コードを自分でゼロから書く力も自信もない中で、AIコーディングツール「Claude Code」のみを使ってタスク管理アプリ「長い長いノート」を開発し、実際に本番環境へデプロイしてユーザーに使ってもらうまでの全工程を約4ヶ月で完遂しました。このアプリは、完了したタスクが自動的にタイムラインに記録されることで「いつ何をしたか」を検索できる点が特徴で、ReactやFirebaseなどの技術スタックを用いたPWA対応の本格的なWebアプリです。開発のきっかけは、タスク管理手法「Long-Ass Note」の完了タスク記録を手動で行う手間を解消したいという具体的な課題意識でした。\n\n開発過程では、Claude Codeに要件定義書の作成からプロトタイプの動的改良、バグの修正案提示までを任せ、約20時間の作業時間でこれを実現しました。しかし、バグの発見は人間が行う必要があり、AIが書いたコードのレビューには限界があると感じたため、AIに先輩エンジニア2人の会話形式でコードレビューをさせる独自の仕組みを確立し、深く理解を深めました。このプロジェクトでは、9,000行に及ぶコードの大部分をAIが生成しましたが、要件定義、設計判断、テスト、バグ発見、セキュリティ設計、公開準備といったコードを書く以外の開発工程は全て自身で行い、単なる「バイブコーディング」に留まらず、リリース後のメンテナンス性まで考慮した、非エンジニアなりのやり方で開発を定義し実践した点が非常に重要です。\n\n要するに：コードが書けないライターが、AIを駆使してアプリの企画から開発、公開、そして継続的な運用まで、全工程を一貫して成し遂げました。",
    "category": "AI",
    "date": "2026-02-15T03:24:03.099Z"
  },
  {
    "id": "hatebu-it-0-0e30f7037dd9",
    "title": "解像度が低いのに、プロンプトなど書けるわけがない。",
    "url": "https://zenn.dev/recurrenthub/articles/1e0e30f7037dd9",
    "source": "Hatena:it",
    "bookmarkCount": 467,
    "summary": "AIを活用したアウトプットにおいて、多くの人は最初から完璧なプロンプトを書こうと試みるものの、期待通りの結果を得られずに挫折しがちです。これは、検索エンジンのように一発で正解が得られるという誤解に基づき、「何を作りたいか」という自身の思考の解像度が低いまま、AIに「良い感じ」の判断基準すら示せないことが根本的な原因であると筆者は指摘します。自分の中に明確な答えがない状態で完璧なプロンプトは書けず、AIは無難な平均点の回答しか返せないため、この問題はプロンプトの技術論ではなく「思考の設計」そのものに関わる課題であると述べられています。\n\nこのような状況を打破する鍵は、まず自分の中に答えがないことを認め、AIとの「壁打ち」を通じて「答えを探す旅」に出ることです。自分の未完成な思考や曖昧なアイデアをそのままAIに投げかけ、そこから返ってくる的外れな回答さえも「思考を研ぐ砥石」として活用することで、次第に「どう問えば問題が解決するか」という正解への鍵を見つけていきます。この試行錯誤の過程で納得のいくアウトプットが得られた時、AIにこれまでの対話履歴を分析させ、「この最高のアウトプットを生み出すために必要だった条件と指示」を抽出して、次回から一発で再現できるプロンプトを「逆生成」させることが本質です。このリバース・プロンプト・エンジニアリングによって、自分一人では気づけなかった具体的な条件や制約が自動的に言語化され、迷走の末にゴールに辿り着いた「思考の抜け殻」として、圧倒的に精度が高い実践的なプロンプトが手に入る点が画期的であり、プロンプトの型学習と組み合わせることで、その効果が最大限に発揮されます。\n\n要するに：完璧なプロンプトは最初から書くものではなく、AIとの「壁打ち」で思考の解像度を高め、その対話履歴からAIに最適なプロンプトを「逆生成」させることで、自分では書けない高精度な実践的プロンプトを手に入れるのが最も効果的である。",
    "category": "Security",
    "date": "2026-02-15T03:24:14.960Z"
  }
]