[
  {
    "id": "hatebu-it-10-d-generator/",
    "title": "AGENTS.mdを自動で育てる仕組みを作った",
    "url": "https://nyosegawa.github.io/posts/agents-md-generator/",
    "source": "Hatena:it",
    "bookmarkCount": 298,
    "summary": "AIコーディングエージェントにとって不可欠なAGENTS.md（CLAUDE.md）という設定ファイルは、その作成と維持に大きな課題を抱えていました。新しいリポジトリを作るたびに内容を考える手間や、プロジェクトの進行とともに記述がすぐに古くなり、むしろエージェントのコンテキストを汚染して効率を下げるという問題が頻繁に発生していました。特に、AIエージェントが確実に従える指示の数には上限があり、わずか20〜30行程度のバジェットしか許されない中で、常に最新かつ最適な情報を人間が手作業で維持することは極めて困難であり、「最初に種を蒔けば勝手に育つ」ような理想的なAGENTS.mdの仕組みが強く求められていました。\n\nこのような課題に対し、筆者は「agents-md-generator」を開発し、その理想を実現しました。このツールは、プロジェクトをクローンした際にAGENTS.mdの最適な足場を自動で生成します。この自動生成されたファイルは、「後方互換性を捨てること」や「20〜30行バジェット」といった重要な原則を明確に提示し、プレースホルダーを埋めては消すことで、限られた指示量の中で効率的に機能するよう設計されています。Gitのtemplate directoryとpost-checkout hookというシンプルな仕組みを活用することで、開発者は手動でのAGENTS.md更新から解放され、常に最新かつエージェントの能力を最大限に引き出すための指示が自動で提供されるため、AIコーディングエージェントの真価を遺憾なく発揮できる画期的な仕組みが構築されたと言えます。\n\n要するに：常に変化するプロジェクトの状況に合わせて、AIエージェントが最大限に機能するよう最適化されたAGENTS.mdを、手間なく自動で生成・維持する画期的な仕組みが実現されたのです。",
    "category": "AI",
    "date": "2026-02-16T03:22:00.801Z"
  },
  {
    "id": "hatebu-it-6-dee08b72db63",
    "title": "また病院がVPN経由でやられたわけだがVPNは悪だね｜ロードバランスすだちくん（仮）",
    "url": "https://note.cloudnative.co.jp/n/ndee08b72db63",
    "source": "Hatena:it",
    "bookmarkCount": 820,
    "summary": "日本医科大学武蔵小杉病院で発生したランサムウェア攻撃は、ナースコールシステムが被害を受け約1万人分の患者情報が流出するという重大な結果を招きましたが、その侵入経路は医療機器保守用VPN装置でした。この事件は、医療業界に限らずあらゆる産業でベンダーが設置する「保守用VPN」が、情報システム部門の管理外に置かれ、パッチ適用や管理者責任が曖昧になりがちであるという、共通の構造的脆弱性を再び浮き彫りにしています。過去の事例でもVPNが主要な侵入口であり続けているのは、VPN技術自体が、設置者・運用者・メーカー全員が完璧に運用し続けなければ安全が保てない「欠陥のある設計（Fragile by Design）」であるため、人間のミスや組織の怠慢を前提としない設計が破綻しているからだと筆者は指摘します。\n\n厚生労働省の「医療情報システムの安全管理に関するガイドライン第6.0版」では、すでに「閉域だから安全」という従来の考え方を否定し、ゼロトラストネットワーク型思考への移行が明記されています。しかし、多くの現場では、ガイドラインが必須とするSSL-VPN利用時のクライアント証明書認証などの要件を満たしておらず、ID/パスワードのみのVPN接続が放置されているのが実情です。これに対し、VPNがリモートアクセス手段の唯一のものではないことを強調し、特定のアプリケーションのみにアクセスを許可するZTNA（Zero Trust Network Access）を活用すれば、より安全かつ効率的なリモート保守が実現でき、ガイドラインに準拠したセキュリティを構築できると示唆されています。\n\n要するに：VPNは運用者の完璧さに依存する脆弱な設計であり、その問題を解決し、より安全なリモートアクセスを実現するにはゼロトラストの導入が不可欠です。",
    "category": "Security",
    "date": "2026-02-16T03:22:15.626Z"
  }
]