[
  {
    "id": "hatebu-it-9-06b4a0865acb",
    "title": "Gemini × NotebookLM 連携で「自分専用エージェント」を量産する：蓄積した履歴を血肉化する究極の活用術",
    "url": "https://zenn.dev/minipoisson/articles/2806b4a0865acb",
    "source": "Hatena:it",
    "bookmarkCount": 343,
    "summary": "これまでのAI活用では、自身のGeminiチャット履歴をNotebookLMで検索・分析できても、特定の目的で使うたびに、毎回細かな指示や必要な資料の指定をチャットで入力する必要があり、手間がかかる課題がありました。これは、まるで図書館に毎回司書を連れて行くような煩わしさでしたが、GeminiのGems機能と2026年1月から利用可能になったNotebookLM連携機能が組み合わさったことで、この課題に革新的な解決策がもたらされました。Gems機能で特定の「役割」（エージェントの人格）を予め定義し、NotebookLMに蓄積された自身の膨大なチャット履歴を「知識」（長期記憶）として紐付けることで、「自分を熟知した専門家」をワンクリックで起動できるようになる点が画期的です。\n\nこの連携の最大のすごさは、短い指示文をGeminiに与えるだけで、数百万トークン規模の背景知識を持つエージェントを動かせる点にあります。これにより、Zenn記事執筆や自己分析、note.com向け記事提案といった特定の目的に特化した「自分専用エージェント」を簡単に量産し、活用できるようになりました。AIは単なる汎用的なツールから、個人の蓄積された経験や知識を血肉とし、特定のタスクにおいて深く共生するパートナーへと進化し、データの量だけでなく、そのデータを上手に活用するための仕組みこそがAI活用の鍵であることが示され、今後の更なる多様な活用法への道が開かれています。\n\n要するに：自身の膨大な知識を血肉とした「自分専用エージェント」を、GeminiとNotebookLMの連携でワンクリックで量産し、特定の目的のために効率的に活用できるようになった。",
    "category": "AI",
    "date": "2026-02-11T06:53:32.582Z"
  },
  {
    "id": "hatebu-it-2-s/20260210a/",
    "title": "ログ設計ガイドラインを公開しました | フューチャー技術ブログ",
    "url": "https://future-architect.github.io/articles/20260210a/",
    "source": "Hatena:it",
    "bookmarkCount": 347,
    "summary": "フューチャー社内の有志メンバーが、システムの稼働状況の可視化やトラブル時の原因特定に不可欠なログの設計ガイドラインを公開しました。これまでログ設計は個々の経験や慣習に委ねられ、プロジェクトごとにバラバラで十分に活用しきれていない状況が見受けられ、システムが複雑化する現代においてはデバッグ用テキストからオブザーバビリティの基盤へと役割が進化しているにも関わらず、必要な情報不足による原因追求の困難さや、フォーマットの不統一による集計のしにくさ、無意味なログによるコストや性能の圧迫といった課題が頻発していました。本ガイドラインは、このような属人的な問題から脱却し、現代の複雑なシステム運用を支えるための強固な基盤を構築することを目指しています。\n\nこのガイドラインの優れた点は、特定のプラットフォームに依存しない標準的な命名規則を推奨し、共通スキーマによって表記揺れをなくしログ解析を容易にする点にあります。さらに、マイクロサービスなどの分散システムにおいて処理を横断的に追跡できるトレースIDや、詳細なリクエスト・DB情報を記録するコンテキスト情報を付与することで、トラブル発生時の調査解像度を飛躍的に向上させ、多角的な分析を可能にします。また、構造化されたメッセージの書き方や運用手順書との連携、通知の最適化、そして機密情報の適切な管理とマスキングについても網羅されており、これにより開発・運用者は迅速かつ効率的に問題解決にあたれるようになるだけでなく、システムの健全性を高いレベルで維持できるようになるため、実務において非常に強力な支援ツールとなります。\n\n要するに：本ガイドラインは、バラバラだったログ設計を標準化・体系化することで、複雑なシステムでもトラブルの原因を迅速に特定し、効率的な運用を可能にする画期的な指針です。",
    "category": "Security",
    "date": "2026-02-11T06:53:42.987Z"
  }
]