[
  {
    "id": "hatebu-it-0-wodoushou-ru",
    "title": "AIプロダクトの品質をどう守る？",
    "url": "https://speakerdeck.com/matsu802/aipurodakutonopin-zhi-wodoushou-ru",
    "source": "Hatena:it",
    "bookmarkCount": 142,
    "summary": "LayerX Inc.のバクラク勤怠が提供するAI機能は、複雑で多岐にわたる就業規則を基に有給休暇の自動付与ルール初期設定案を作成するものであり、金銭に関わる繊細な設定をAIが行うため、その品質保証はAI特有の「確率」との戦いを意味します。AIは100%完璧ではないという事実を踏まえ、同社は品質を「ユーザーの期待値に対する仮説」「精度を評価するための基準」「UXデザインによる期待値調整」の3つの軸で明確に定義することで、目指すべきゴールをチームで共有し、安心してリリースできる基盤を築きました。\n\nこの品質定義に基づき、ユーザーにはAIが完璧ではないことを共有しつつ、AIの出力はあくまでサジェスト機能とし、最終的なルール作成はユーザーが行うデザインを採用することで、過度な期待を抑制し、安心して利用できる環境を構築しています。また、リリース前には各ユースケースで90%以上の精度を受け入れ基準とした厳格な検証を実施し、さらに継続的な改善の仕組みとして、オープンソースのAPIテスト自動化ツール「runn」を用いて確率的なAIの挙動を定量的に評価し、システム全体の動作と精度を担保しています。加えて、LLMアプリケーション向け監視・評価プラットフォーム「Langfuse」を活用し、ユーザーからのフィードバックを基に実際のデータを分析してテストケースに追加することで、プロンプトの継続的な改善サイクルを回し、AIプロダクトの品質を着実に向上させています。\n\n要するに：AIの不確実性を前提としつつも、明確な品質定義とユーザー期待値の調整、そして継続的なテストとフィードバックによる改善サイクルを確立することで、AIプロダクトの品質を維持・向上させている。",
    "category": "AI",
    "date": "2026-02-17T03:16:10.536Z"
  },
  {
    "id": "hatebu-it-5-02/16/173000",
    "title": "自分のOSSリポジトリにGitHubのセキュリティ設定を入れ、自分用の手順書を作った - $shibayu36->blog;",
    "url": "https://blog.shibayu36.org/entry/2026/02/16/173000",
    "source": "Hatena:it",
    "bookmarkCount": 128,
    "summary": "有名なオープンソースソフトウェア（OSS）が攻撃を受ける事例が相次ぐ現状を受け、著者は自身のOSSリポジトリにも最低限のGitHubセキュリティ設定を導入することの重要性を痛感しました。GitHubの公式ドキュメントや複数のセキュリティ専門ブログを参考にし、さらにはAIの協力も得て、誰でも利用できる具体的なセキュリティ設定の手順書を作成・公開したことは、個人のOSS開発者におけるセキュリティ意識の向上と実践を促す点で大変意義深い取り組みです。\n\nこの手順書では、依存関係の脆弱性を通知するDependabot Alertsや外部からの非公開な脆弱性報告を受け付けるPrivate vulnerability reporting、静的解析ツールCodeQLによる脆弱性の検出、トークンやAPIキーの混入を防ぐSecret scanningとプッシュ保護といった多岐にわたる設定が示されています。加えて、メインブランチへの直接プッシュ禁止やCIの必須化、バージョンタグの保護、さらにはリリースの不変性を確保する機能まで網羅されており、個人の開発者が自身のOSSプロジェクトを様々な脅威から包括的に保護するための、実践的かつ具体的な道筋を提供しています。\n\n要するに：有名なOSSへの攻撃事例から学び、著者は自身のOSSリポジトリに包括的なGitHubセキュリティ設定を導入し、その具体的な手順書を公開することで、他の開発者も簡単にセキュリティ強化に取り組める道筋を示しました。",
    "category": "Security",
    "date": "2026-02-17T03:16:19.106Z"
  }
]